app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    # @users = User.all
    @users = User.paginate(page: params[:page])

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def show
    @user = User.find(params[:id])

UPDATE `users` SET `name` = 'Jindo Kuyo', `password_digest` = '$2a$10$ccMtCqDLnxDxrQ1tiDTGPOtlOQpbkgWUETY0WQq1cCPUOt2EzAO6K', `updated_at` = '2015-05-04 02:20:14' WHERE `users`.`id` = 1
---
  def update
    if @user.update_attributes(user_params)